package _2024_01_17;

public class Task_2 {
    public static void main(String[] args) {
        //Дано 5 чисел:  а=10,  b=15, c= 20, d=25, e=30.
        //Переприсвоить и вывести их на экран в том же порядке(a,b,c,d,e), НО, таким образом, чтобы каждая переменная принимала “следующее” значение из этой цепочки.
        //Пример: было а=10 стало b=15;  было е=30 стало е=10.
        //Примечание: присваивать “напрямую” значения нельзя, все манипуляции должны происходить за счёт переменных, а не их значений.
       // int a = 10;
        //int b = 15;
        //int c = 20;
       // int d = 25;
       // int e = 30;
        //int f = a;
        //a = b;
       // b = c;
       // c = d;
       // d = e;
       // e = f;
       // System.out.println(a);
       // System.out.println(b);
       // System.out.println(c);
       // System.out.println(d);
       // System.out.println(e);


        //Дано трехзначное число. Вывести на экран все цифры этого числа.
        //
        //Пример: 345
        //Вывод в консоль: Число 345 -> 3, 4, 5
//        int a = 345;
//
//        int b = a / 100;
//        int c = (a - b * 100) / 10;
//        int d = a % 10;

//        int a = 649;
//        int b = a / 100;
//        int c = (a - b * 100) / 10;
//        int d = a % 10;
//
//        System.out.println("Число " + a + " -> " + b + ", " + c + ", " + d);


    }
}